[
  {
    "title": "The BEST Authentic Italian Minestrone Recipe",
    "direction": "In a large, heavy-bottomed pot, add olive oil, onions, carrots, and celery. Set over medium heat and let sizzle for 4 to 5 minutes or until they begin to soften. Tie the bay leaves and rosemary together with kitchen twine and add them to the pot, followed by the tomatoes. Gently crush the tomatoes with a wooden spoon to break them into chunks. Let sizzle for 2 minutes.\nAdd potatoes along with a cup of boiling water. Once the water simmers, add the cauliflower broccoli, cabbage, and broccoli rabe.\nAdd boiling water to the pot, filling it just until all of the vegetables are submerged. Add the Parmigiano rinds (if using), a generous pinch of salt, and a scruuunch of pepper. Let cook for an additional 20 to 30 minutes, then add the beans.\nLet it cook for another 10-15 minutes, and the minestrone is ready!\nTop it off with some grated Parmigiano cheese and toasted bread (optional).\nEnjoy!",
    "description": "This soup is like a warm hug from Nonna. It’s filled with fresh, seasonal vegetables and simmered to perfection with some tomatoes and Parmigiano rind, which creates a beautiful broth. What I love about this recipe is the authentic way to make it is to just use what you have and let the season be your guide. No pot of minestrone will ever be exactly the same; the key is to use the freshest ingredients you can find and the method I outline below, and you’ll wind up with something just gorgeous, just like you are. This is one of my favorite dishes to enjoy in the winter months, and I hope once you try it, it will also become a favorite in your family!",
    "ingredients": "¼ cup olive oil\n1 medium onion, diced\n1 carrot, diced\n2 celery stalks, diced\n2 bay leaves\n1 small branch of rosemary\n1 cup whole peeled tomatoes\n2 medium potatoes, peeled and chopped\n½ head cauliflower, cut into florets\n½ head broccoli, cut into florets\n1 cup shredded green cabbage\n2 cups roughly chopped broccoli rabe\nSalt and pepper, to taste\n1-2 Parmigiano rinds, scraped and diced (optional)\n1 cup cooked borlotti or cannellini beans"
  }
]
